export default {
  uploadDocument: 'دستاویز اپ لوڈ کریں',
  importDocument: 'دستاویز درآمد کریں',
  syncDocument: 'دستاویز مطابقت کریں',
  selected: 'منتخب شدہ',
  items: 'اشیاء',
  searchBar: {
    placeholder: 'دستاویز کے نام سے تلاش کریں'
  },
  setting: {
    migration: 'منتقلی',
    cancelGenerateQuestion: 'سوالات بنانے کو منسوخ کریں',
    cancelVectorization: 'ویکٹرائزیشن منسوخ کریں',
    cancelGenerate: 'پیداوار منسوخ کریں',
    export: 'اس میں برآمد کریں'
  },
  tip: {
    saveMessage: 'موجودہ تبدیلیوں کو محفوظ نہیں کیا گیا ہے۔ خارج ہونے کی تصدیق کریں؟',
    cancelSuccess: 'کامیاب',
    sendMessage: 'کامیاب',
    vectorizationSuccess: 'کامیاب',
    nameMessage: 'دستاویز کا نام خالی نہیں ہو سکتا!',
    importMessage: 'کامیاب',
    migrationSuccess: 'کامیاب'
  },
  upload: {
    selectFile: 'فائل منتخب کریں',
    selectFiles: 'فولڈر منتخب کریں',
    uploadMessage: 'فائل اپ لوڈ کرنے کے لیے یہاں ڈریگ اینڈ ڈراپ کریں یا',
    formats: 'مدعوم فارمیٹ:',
    requiredMessage: 'براہ کرم فائل اپ لوڈ کریں',
    errorMessage1: 'فائل کا سائز 100mb سے زیادہ ہے',
    errorMessage2: 'غیر مدعوم فائل فارمیٹ',
    errorMessage3: 'فائل خالی نہیں ہو سکتی',
    errorMessage4: 'ایک بار میں زیادہ سے زیادہ 50 فائلیں اپ لوڈ کی جا سکتی ہیں',
    template: 'ٹیمپلیٹ',
    download: 'ڈاؤن لوڈ کریں'
  },

  fileType: {
    txt: {
      label: 'متنی فائل',
      tip1: '1. اپ لوڈ کرنے سے پہلے فائل میں سگمنٹ مارکروں کو معیاری بنانا مشورہ دیا جاتا ہے۔',
      tip2: '2. ایک بار میں زیادہ سے زیادہ 50 فائلیں اپ لوڈ کی جا سکتی ہیں، اور ہر فائل کا سائز 100MB سے زیادہ نہیں ہو سکتا۔'
    },
    table: {
      label: 'ٹیبل',
      tip1: '1. متعلقہ ٹیمپلیٹ ڈاؤن لوڈ کرنے کے لیے کلک کریں اور معلومات مکمل کریں:',
      tip2: '2. پہلی قطار کالم کے ہیڈرز ہونے ضروری ہیں، اور کالم کے ہیڈرز کا معنی والا الفاظ ہونے چاہئیں۔ ٹیبل کے ہر ریکارڈ کو ایک سگمنٹ کے طور پر لیا جائے گا۔',
      tip3: '3. اپ لوڈ کردہ اسپریڈشیٹ فائل کی ہر ورکشاٹ کو ایک دستاویز کے طور پر لیا جائے گا، جس کا نام ورکشاٹ کا نام ہو گا۔',
      tip4: '4. ایک بار میں زیادہ سے زیادہ 50 فائلیں اپ لوڈ کی جا سکتی ہیں، اور ہر فائل کا سائز 100MB سے زیادہ نہیں ہو سکتا۔'
    },
    QA: {
      label: 'سوال و جواب جوڑے',
      tip1: '1. متعلقہ ٹیمپلیٹ ڈاؤن لوڈ کرنے کے لیے کلک کریں اور معلومات مکمل کریں:',
      tip2: '2. اپ لوڈ کردہ اسپریڈشیٹ فائل کی ہر ورکشاٹ کو ایک دستاویز کے طور پر لیا جائے گا، جس کا نام ورکشاٹ کا نام ہو گا۔',
      tip3: '3. ایک بار میں زیادہ سے زیادہ 50 فائلیں اپ لوڈ کی جا سکتی ہیں، اور ہر فائل کا سائز 100MB سے زیادہ نہیں ہو سکتا۔'
    }
  },
  setRules: {
    title: {
      setting: 'سگمنٹ کے قواعد مقرر کریں',
      preview: 'پیش نظارہ'
    },
    intelligent: {
      label: 'خودکار سگمنٹیشن (مشورہ دیا گیا)',
      text: 'اگر آپ کو سگمنٹیشن کے قواعد مقرر کرنے کا طریقہ معلوم نہیں ہے، تو خودکار سگمنٹیشن استعمال کرنے کا مشورہ دیا جاتا ہے۔'
    },
    advanced: {
      label: 'اعلیٰ سگمنٹیشن',
      text: 'صارفین دستاویز کے معیار کے مطابق سگمنٹیشن کے تقسیم کنندگان، سگمنٹ لمبائی اور صفائی کے قواعد کو کسٹمائیز کر سکتے ہیں۔'
    },
    patterns: {
      label: 'سگمنٹ کے تقسیم کنندگان',
      tooltip:
        'ترتیب سے منتخب کردہ علامات کے مطابق باقاعدہ طور پر تقسیم کریں۔ اگر تقسیم کے نتیجے کی لمبائی سگمنٹ کی لمبائی سے زیادہ ہو، تو یہ سگمنٹ کی لمبائی تک کاٹ دیا جائے گا۔',
      placeholder: 'براہ کرام منتخب کریں'
    },
    limit: {
      label: 'سگمنٹ کی لمبائی'
    },
    with_filter: {
      label: 'خودکار صفائی',
      text: 'دوبارہ پڑھنے والے علامات، خالی جگہیں، خالی لائنیں اور ٹیب الفاظ کو حذف کریں۔'
    },
    checkedConnect: {
      label: 'سوالات پر مبنی QA جوڑے کو درآمد کرتے وقت "متعلقہ سوالات" کا حصہ شامل کریں۔'
    }
  },
  buttons: {
    prev: 'پچھلا',
    next: 'اگلا',
    import: 'درآمد شروع کریں',
    preview: 'لاگو کریں'
  },
  table: {
    name: 'دستاویز کا نام',
    char_length: 'حروف',
    paragraph: 'سگمنٹ',
    all: 'تمام',
    updateTime: 'ترمیم کا وقت'
  },
  fileStatus: {
    label: 'فائل کی حالت',
    SUCCESS: 'کامیاب',
    FAILURE: 'ناکام',
    EMBEDDING: 'انڈیکسنگ',
    PENDING: 'قائمہ',
    GENERATE: 'تیار کرنا',
    SYNC: 'مطابقت کرنا',
    REVOKE: 'منسوخ کرنا',
    finish: 'ختم'
  },
  enableStatus: {
    label: 'حالت',
    enable: 'فعال',
    close: 'غیر فعال'
  },
  sync: {
    label: 'مطابقت',
    confirmTitle: 'دستاویز کی مطابقت کی تصدیق کریں؟',
    confirmMessage1:
      'مطابقت موجودہ مواد کو حذف کرے گی اور نئے مواد کو واپس لے آئے گی۔ براہ کرم احتیاط کے ساتھ آگے بڑھیں۔',
    confirmMessage2: 'مطابقت نہیں کی جا سکتی، براہ کرام پہلے دستاویز کا URL ترتیب دیں۔',
    successMessage: 'کامیاب'
  },
  delete: {
    confirmTitle1: 'یقینی بنائیں کہ ',
    confirmTitle2: 'دستاویزیں حذف کی جائیں؟',
    confirmMessage:
      'منتخب کردہ دستاویزوں کے اندر موجود تمام سگمنٹ بھی حذف کر دیے جائیں گے۔ براہ کرم احتیاط کے ساتھ آگے بڑھیں۔',
    successMessage: 'کامیاب',
    confirmTitle3: 'دستاویز کو حذف کرنے کی تصدیق کریں:',
    confirmMessage1: 'اس دستاویز کے تحت',
    confirmMessage2: 'تمام سگمنٹ حذف کر دیے جائیں گے، براہ کرام احتیاط کے ساتھ کام کریں۔'
  },
  form: {
    source_url: {
      label: 'دستاویز URL',
      placeholder: 'ایک لائن میں دستاویز URL درج کریں۔ غلط URL درآمد کی عدم کامیابی کا سبب بنے گی۔',
      requiredMessage: 'براہ کرام دستاویز URL درج کریں'
    },
    selector: {
      label: 'سلیکٹر',
      placeholder: 'ڈیفالٹ body ہے، آپ .classname/#idname/tagname درج کر سکتے ہیں'
    },
    hit_handling_method: {
      label: 'تفتیش-جواب',
      tooltip: 'جب صارف سوال پوچھے، تو مطابقت والے سگمنٹ کو مقررہ طریقہ کے مطابق سنبھالیں۔'
    },
    similarity: {
      label: 'مماثلت سے زیادہ',
      placeholder: 'سگمنٹ کے مواد کو براہ راست واپس کریں',
      requiredMessage: 'براہ کرام مماثلت کی قدر درج کریں'
    }
  },
  hitHandlingMethod: {
    optimization: 'ماڈل کی ترقی',
    directly_return: 'براہ راست جواب دیں'
  },
  generateQuestion: {
    title: 'سوالات پیدا کریں',
    successMessage: 'کامیاب',
    tip1: 'پرامپٹ میں {data} ایک پلیس ہولڈر ہے جو سگمنٹ کے مواد کے لیے استعمال ہوتا ہے، جو اجرت کے دوران سگمنٹ کے مواد سے تبدیل ہو جائے گا اور AI ماڈل کو بھیجا جائے گا؛',
    tip2: 'AI ماڈل سگمنٹ کے مواد کے مطابق متعلقہ سوالات پیدا کرتا ہے۔ براہ کرام تیار کردہ سوالات کو',
    tip3: 'ٹیگز کے اندر رکھیں، اور سسٹم خود بخود ان ٹیگز کے اندر موجود سوالات کو متعلقہ بنائے گا؛',
    tip4: 'پیداوار کا اثر منتخب کردہ ماڈل اور پرامپٹ پر منحصر ہے۔ صارفین بہترین اثر حاصل کرنے کے لیے ترتیب دے سکتے ہیں۔',
    prompt1:
      'مواد: {data}\n \n براہ کرام اوپر کو خلاصہ کریں اور خلاصہ کی بنیاد پر 5 سوالات پیدا کریں۔ \n جواب کی ضروریات: \n - صرف سوالات کو آؤٹ پٹ کریں؛ \n - ہر سوال کو',
    prompt2: 'ٹیگ میں رکھیں۔'
  }
}