export default {
  uploadDocument: 'بارگذاری سند',
  importDocument: 'وارد کردن سند',
  syncDocument: 'همگام‌سازی سند',
  selected: 'انتخاب شده',
  items: 'موارد',
  searchBar: {
    placeholder: 'جستجو بر اساس نام سند'
  },
  setting: {
    migration: 'انتقال',
    cancelGenerateQuestion: 'لغو تولید سؤالات',
    cancelVectorization: 'لغو بردارسازی',
    cancelGenerate: 'لغو تولید',
    export: 'خروجی به'
  },
  tip: {
    saveMessage: 'تغییرات فعلی ذخیره نشده‌اند. آیا مطمئن هستید که می‌خواهید خارج شوید؟',
    cancelSuccess: 'موفقیت‌آمیز',
    sendMessage: 'موفقیت‌آمیز',
    vectorizationSuccess: 'موفقیت‌آمیز',
    nameMessage: 'نام سند نمی‌تواند خالی باشد!',
    importMessage: 'موفقیت‌آمیز',
    migrationSuccess: 'موفقیت‌آمیز'
  },
  upload: {
    selectFile: 'انتخاب فایل',
    selectFiles: 'انتخاب پوشه',
    uploadMessage: 'فایل‌ها را اینجا بکشید و رها کنید یا',
    formats: 'فرمت‌های پشتیبانی‌شده:',
    requiredMessage: 'لطفاً یک فایل بارگذاری کنید',
    errorMessage1: 'حجم فایل بیشتر از ۱۰۰ مگابایت است',
    errorMessage2: 'فرمت فایل پشتیبانی نمی‌شود',
    errorMessage3: 'فایل نمی‌تواند خالی باشد',
    errorMessage4: 'حداکثر می‌توانید ۵۰ فایل را به‌صورت همزمان بارگذاری کنید',
    template: 'قالب',
    download: 'دانلود'
  },

  fileType: {
    txt: {
      label: 'فایل متنی',
      tip1: '۱. توصیه می‌شود قبل از بارگذاری، نشانگرهای بخش در فایل استاندارد شوند.',
      tip2: '۲. حداکثر می‌توانید ۵۰ فایل را به‌صورت همزمان بارگذاری کنید، هر فایل نباید بیشتر از ۱۰۰ مگابایت باشد.'
    },
    table: {
      label: 'جدول',
      tip1: '۱. کلیک کنید تا قالب مربوطه را دانلود کرده و اطلاعات را تکمیل کنید:',
      tip2: '۲. ردیف اول باید عنوان ستون‌ها باشد و عناوین ستون باید اصطلاحات معنادار باشند. هر رکورد در جدول به‌عنوان یک بخش در نظر گرفته خواهد شد.',
      tip3: '۳. هر برگه در فایل صفحه‌گسترده بارگذاری‌شده به‌عنوان یک سند در نظر گرفته می‌شود و نام برگه به‌عنوان نام سند خواهد بود.',
      tip4: '۴. حداکثر می‌توانید ۵۰ فایل را به‌صورت همزمان بارگذاری کنید، هر فایل نباید بیشتر از ۱۰۰ مگابایت باشد.'
    },
    QA: {
      label: 'جفت سؤال و پاسخ',
      tip1: '۱. کلیک کنید تا قالب مربوطه را دانلود کرده و اطلاعات را تکمیل کنید:',
      tip2: '۲. هر برگه در فایل صفحه‌گسترده بارگذاری‌شده به‌عنوان یک سند در نظر گرفته می‌شود و نام برگه به‌عنوان نام سند خواهد بود.',
      tip3: '۳. حداکثر می‌توانید ۵۰ فایل را به‌صورت همزمان بارگذاری کنید، هر فایل نباید بیشتر از ۱۰۰ مگابایت باشد.'
    }
  },
  setRules: {
    title: {
      setting: 'تنظیم قوانین بخش‌بندی',
      preview: 'پیش‌نمایش'
    },
    intelligent: {
      label: 'بخش‌بندی خودکار (توصیه‌شده)',
      text: 'اگر مطمئن نیستید چگونه قوانین بخش‌بندی را تنظیم کنید، توصیه می‌شود از بخش‌بندی خودکار استفاده کنید.'
    },
    advanced: {
      label: 'بخش‌بندی پیشرفته',
      text: 'کاربران می‌توانند بر اساس استانداردهای سند، جداکننده‌های بخش، طول بخش و قوانین پاک‌سازی را سفارشی کنند.'
    },
    patterns: {
      label: 'جداکننده‌های بخش',
      tooltip:
        'به‌ترتیب بر اساس نمادهای انتخاب‌شده تقسیم‌بندی بازگشتی انجام می‌شود. اگر نتیجه تقسیم‌بندی از طول بخش فراتر رود، به طول بخش خواهد بود.',
      placeholder: 'لطفاً انتخاب کنید'
    },
    limit: {
      label: 'طول بخش'
    },
    with_filter: {
      label: 'پاک‌سازی خودکار',
      text: 'حذف نمادهای اضافی تکراری، فضاهای خالی، خطوط خالی و کلمات تب.'
    },
    checkedConnect: {
      label: 'افزودن بخش "سوالات مرتبط" برای جفت سؤال و پاسخ در هنگام وارد کردن.'
    }
  },
  buttons: {
    prev: 'قبلی',
    next: 'بعدی',
    import: 'شروع وارد کردن',
    preview: 'اعمال'
  },
  table: {
    name: 'نام سند',
    char_length: 'کاراکتر',
    paragraph: 'بخش',
    all: 'همه',
    updateTime: 'زمان به‌روزرسانی'
  },
  fileStatus: {
    label: 'وضعیت فایل',
    SUCCESS: 'موفق',
    FAILURE: 'شکست',
    EMBEDDING: 'در حال اندیس‌گذاری',
    PENDING: 'در صف',
    GENERATE: 'در حال تولید',
    SYNC: 'در حال همگام‌سازی',
    REVOKE: 'در حال لغو',
    finish: 'پایان'
  },
  enableStatus: {
    label: 'وضعیت',
    enable: 'فعال',
    close: 'غیرفعال'
  },
  sync: {
    label: 'همگام‌سازی',
    confirmTitle: 'آیا مطمئن هستید که می‌خواهید سند را همگام‌سازی کنید؟',
    confirmMessage1:
      'همگام‌سازی داده‌های موجود را حذف کرده و داده‌های جدید را بازیابی می‌کند. لطفاً با احتیاط عمل کنید.',
    confirmMessage2: 'نمی‌توان همگام‌سازی کرد، لطفاً ابتدا URL سند را تنظیم کنید.',
    successMessage: 'موفقیت‌آمیز'
  },
  delete: {
    confirmTitle1: 'آیا مطمئن هستید که می‌خواهید حذف دسته‌جمعی انجام دهید؟',
    confirmTitle2: 'سند(ها)؟',
    confirmMessage:
      'بخش‌های داخل اسناد انتخاب‌شده نیز حذف خواهند شد. لطفاً با احتیاط عمل کنید.',
    successMessage: 'موفقیت‌آمیز',
    confirmTitle3: 'آیا مطمئن هستید که می‌خواهید سند را حذف کنید:',
    confirmMessage1: 'تحت این سند',
    confirmMessage2: 'تمام بخش‌ها حذف خواهند شد، لطفاً با احتیاط عمل کنید.'
  },
  form: {
    source_url: {
      label: 'URL سند',
      placeholder: 'هر خط یک URL سند وارد کنید. URL نادرست باعث شکست وارد کردن خواهد شد.',
      requiredMessage: 'لطفاً یک URL سند وارد کنید'
    },
    selector: {
      label: 'انتخاب‌گر',
      placeholder: 'پیش‌فرض body است، می‌توانید .classname/#idname/tagname وارد کنید'
    },
    hit_handling_method: {
      label: 'استخراج-پاسخ',
      tooltip: 'هنگامی که کاربر سؤالی می‌پرسد، بر اساس روش تنظیم‌شده بخش‌های مطابق را مدیریت کنید.'
    },
    similarity: {
      label: 'شباهت بالاتر از',
      placeholder: 'محتوای بخش را به‌طور مستقیم بازمی‌گرداند',
      requiredMessage: 'لطفاً مقدار شباهت را وارد کنید'
    }
  },
  hitHandlingMethod: {
    optimization: 'بهینه‌سازی مدل',
    directly_return: 'پاسخ مستقیم'
  },
  generateQuestion: {
    title: 'تولید سؤالات',
    successMessage: 'موفقیت‌آمیز',
    tip1: '{data} در متن پیش‌فرض، محل قرارگیری محتوای بخش است که هنگام اجرا با محتوای بخش جایگزین شده و به مدل هوش مصنوعی ارسال می‌شود؛',
    tip2: 'مدل هوش مصنوعی بر اساس محتوای بخش، سؤالات مرتبط تولید می‌کند. لطفاً سؤالات تولیدشده را درون',
    tip3: 'قرار دهید، سیستم به‌صورت خودکار سؤالات داخل این تگ‌ها را مرتبط می‌کند؛',
    tip4: 'اثر تولید بستگی به مدل انتخاب‌شده و متن پیش‌فرض دارد. کاربران می‌توانند برای دستیابی به بهترین اثر تنظیمات را تغییر دهند.',
    prompt1:
      'محتوا: {data}\n \n لطفاً موارد فوق را خلاصه کرده و بر اساس خلاصه ۵ سؤال تولید کنید. \n الزامات پاسخ: \n - فقط سؤالات را خروجی دهید؛ \n - هر سؤال را در',
    prompt2: 'قرار دهید.'
  }
}