export default {
  node: 'নোড',
  nodeName: 'নোড নাম',
  baseComponent: 'মৌলিক',
  nodeSetting: 'নোড সেটিংস',
  workflow: 'ওয়ার্কফ্লো',
  searchBar: {
    placeholder: 'নাম অনুসারে খুঁজুন'
  },
  info: {
    previewVersion: 'প্রিভিউ সংস্করণ:',
    saveTime: 'সর্বশেষ সংরক্ষণ:'
  },
  setting: {
    restoreVersion: 'পূর্ববর্তী সংস্করণ পুনরুদ্ধার করুন"',
    restoreCurrentVersion: 'এই সংস্করণে পুনরুদ্ধার করুন',
    addComponent: 'যোগ করুন',
    public: 'প্রকাশ করুন',
    releaseHistory: 'রিলিজ ইতিহাস',
    autoSave: 'অটো সেভ',
    latestRelease: 'সর্বশেষ রিলিজ',
    copyParam: 'প্যারামিটার কপি করুন',
    debug: 'চালু করুন',
    exit: 'বের হয়ে যান',
    exitSave: 'সেভ করুন এবং বের হয়ে যান',
  },
  tip: {
    publicSuccess: 'সফলভাবে প্রকাশিত',
    noData: 'কোনো সম্পর্কিত ফলাফল পাওয়া যায়নি',
    nameMessage: 'নাম খালি হতে পারে না!',
    onlyRight: 'সংযোগ কেবল ডান আংকর থেকে করা যাবে',
    notRecyclable: 'লুপ সংযোগ অনুমোদিত নয়',
    onlyLeft: 'সংযোগ কেবল বাম আংকরে করা যাবে',
    applicationNodeError: 'এই অ্যাপ্লিকেশনটি অনুপলব্ধ',
    functionNodeError: 'এই ফাংশন নোডটি অনুপলব্ধ',
    repeatedNodeError: 'এই নামের একটি নোড ইতিমধ্যে বিদ্যমান',
    cannotCopy: 'কপি করা যাবে না',
    copyError: 'নোডটি ইতিমধ্যে কপি করা হয়েছে',
    paramErrorMessage: 'প্যারামিটারটি ইতিমধ্যে বিদ্যমান: ',
    saveMessage: 'বর্তমান পরিবর্তনগুলি সংরক্ষণ করা হয়নি। বের হওয়ার আগে সংরক্ষণ করবেন?',
  },
  delete: {
    confirmTitle: 'এই নোডটি মুছে ফেলতে চান?',
    deleteMessage: 'এই নোডটি মুছে ফেলা যাবে না'
  },
  control: {
    zoomOut: 'জুম আউট',
    zoomIn: 'জুম ইন',
    fitView: 'স্ক্রিনে ফিট করুন',
    retract: 'সব গুটিয়ে নিন',
    extend: 'সব বিস্তৃত করুন',
    beautify: 'স্বয়ংক্রিয়ভাবে সাজান'
  },
  variable: {
    label: 'ভেরিয়েবল',
    global: 'গ্লোবাল ভেরিয়েবল',
    Referencing: 'রেফারেন্সকৃত ভেরিয়েবল',
    ReferencingRequired: 'রেফারেন্সকৃত ভেরিয়েবল প্রয়োজন',
    ReferencingError: 'অবৈধ রেফারেন্সকৃত ভেরিয়েবল',
    NoReferencing: 'রেফারেন্সকৃত ভেরিয়েবল বিদ্যমান নেই',
    placeholder: 'দয়া করে একটি ভেরিয়েবল নির্বাচন করুন'
  },
  condition: {
    title: 'এক্সিকিউশন শর্ত',
    front: 'পূর্বশর্ত',
    AND: 'সব',
    OR: 'যেকোনো',
    text: 'সংযুক্ত নোড এক্সিকিউট হওয়ার পর বর্তমান নোড এক্সিকিউট করুন'
  },
  validate: {
    startNodeRequired: 'শুরুর নোড প্রয়োজন',
    startNodeOnly: 'শুধুমাত্র একটি শুরুর নোড অনুমোদিত',
    baseNodeRequired: 'মৌলিক তথ্য নোড প্রয়োজন',
    baseNodeOnly: 'শুধুমাত্র একটি মৌলিক তথ্য নোড অনুমোদিত',
    notInWorkFlowNode: 'ওয়ার্কফ্লোতে নোড নেই',
    noNextNode: 'পরবর্তী নোড নেই',
    nodeUnavailable: 'নোডটি অনুপলব্ধ',
    needConnect1: 'নোডের শাখাটি সংযুক্ত করা প্রয়োজন',
    cannotEndNode: 'এই নোডটি শেষ নোড হিসাবে ব্যবহার করা যাবে না'
  },
  nodes: {
    startNode: {
      label: 'শুরু',
      question: 'ব্যবহারকারীর প্রশ্ন',
      currentTime: 'বর্তমান সময়'
    },
    baseNode: {
      label: 'মৌলিক তথ্য',
      appName: {
        label: 'অ্যাপ নাম'
      },
      appDescription: {
        label: 'অ্যাপ বর্ণনা'
      },
      fileUpload: {
        label: 'ফাইল আপলোড',
        tooltip: 'সক্রিয় করলে, Q&A পৃষ্ঠায় একটি ফাইল আপলোড বোতাম প্রদর্শিত হবে।'
      },
      FileUploadSetting: {
        title: 'ফাইল আপলোড সেটিংস',
        maxFiles: 'প্রতি আপলোডে সর্বোচ্চ ফাইল সংখ্যা',
        fileLimit: 'প্রতি ফাইলের সর্বোচ্চ আকার (MB)',
        fileUploadType: {
          label: 'আপলোডের জন্য অনুমোদিত ফাইল টাইপ',
          documentText: 'ডকুমেন্ট বিষয়বস্তু বিশ্লেষণের জন্য "ডকুমেন্ট কন্টেন্ট এক্সট্রাকশন" নোড প্রয়োজন',
          imageText: 'চিত্র বিষয়বস্তু বিশ্লেষণের জন্য "চিত্র বোঝার" নোড প্রয়োজন',
          audioText: 'অডিও বিষয়বস্তু বিশ্লেষণের জন্য "স্পিচ-টু-টেক্সট" নোড প্রয়োজন'
        }
      }
    },
    aiChatNode: {
      label: 'AI চ্যাট',
      text: 'একটি AI মডেলের সাথে চ্যাট করুন',
      answer: 'AI বিষয়বস্তু',
      returnContent: {
        label: 'বিষয়বস্তু ফেরত দিন',
        tooltip: `যদি বন্ধ করা হয়, এই নোডের বিষয়বস্তু ব্যবহারকারীকে আউটপুট করা হবে না। 
                  যদি ব্যবহারকারীকে এই নোডের আউটপুট দেখাতে চান, তাহলে সুইচটি চালু করুন।`
      },
      defaultPrompt: 'জানা তথ্য',
      think: 'চিন্তার প্রক্রিয়া'
    },
    searchDatasetNode: {
      label: 'জ্ঞান পুনরুদ্ধার',
      text: 'জ্ঞান থেকে ব্যবহারকারীর প্রশ্ন সম্পর্কিত টেক্সট বিষয়বস্তু খুঁজুন',
      paragraph_list: 'পুনরুদ্ধারকৃত অংশের তালিকা',
      is_hit_handling_method_list: 'সরাসরি প্রতিক্রিয়া মানদণ্ড পূরণকারী অংশের তালিকা',
      result: 'অনুসন্ধান ফলাফল',
      directly_return: 'সরাসরি প্রতিক্রিয়া মানদণ্ড পূরণকারী অংশের বিষয়বস্তু',
      searchParam: 'পুনরুদ্ধার প্যারামিটার',
      searchQuestion: {
        label: 'প্রশ্ন',
        placeholder: 'দয়া করে একটি অনুসন্ধান প্রশ্ন নির্বাচন করুন',
        requiredMessage: 'দয়া করে একটি অনুসন্ধান প্রশ্ন নির্বাচন করুন'
      }
    },
    questionNode: {
      label: 'প্রশ্ন অপ্টিমাইজেশন',
      text: 'ইতিহাস ভিত্তিক চ্যাট রেকর্ডের উপর ভিত্তি করে বর্তমান প্রশ্নটি অপ্টিমাইজ এবং উন্নত করুন যাতে জ্ঞান অংশের সাথে ভালভাবে মিলে যায়',
      result: 'অপ্টিমাইজড প্রশ্ন ফলাফল',
      defaultPrompt1: `ব্যবহারকারীর প্রশ্নটি প্রসঙ্গের ভিত্তিতে অপ্টিমাইজ এবং উন্নত করুন:`,
      defaultPrompt2: `দয়া করে একটি অপ্টিমাইজড প্রশ্ন আউটপুট করুন।`,
      systemDefault: 'আপনি একজন প্রশ্ন অপ্টিমাইজেশন বিশেষজ্ঞ'
    },
    conditionNode: {
      label: 'শর্তসাপেক্ষ শাখা',
      text: 'শর্তের ভিত্তিতে বিভিন্ন নোড ট্রিগার করুন',
      branch_name: 'শাখার নাম',
      conditions: {
        label: 'শর্তসমূহ',
        info: 'নিম্নলিখিতগুলি পূরণ করে',
        requiredMessage: 'দয়া করে শর্তসমূহ নির্বাচন করুন'
      },
      valueMessage: 'দয়া করে একটি মান লিখুন',
      addCondition: 'শর্ত যোগ করুন',
      addBranch: 'শাখা যোগ করুন'
    },
    replyNode: {
      label: 'নির্দিষ্ট প্রতিক্রিয়া',
      text: 'নির্দিষ্ট প্রতিক্রিয়া বিষয়বস্তু সেট করুন, রেফারেন্সকৃত ভেরিয়েবলগুলি স্ট্রিং হিসাবে আউটপুটে রূপান্তরিত হবে',
      content: 'বিষয়বস্তু',
      replyContent: {
        label: 'প্রতিক্রিয়া বিষয়বস্তু',
        custom: 'কাস্টম',
        reference: 'রেফারেন্স ভেরিয়েবল'
      }
    },
    rerankerNode: {
      label: 'মাল্টি-পাথ রিকল',
      text: 'বিভিন্ন জ্ঞান উৎস থেকে পুনরুদ্ধার ফলাফল পুনরায় সাজানোর জন্য একটি পুনরায় সাজানোর মডেল ব্যবহার করুন',
      result_list: 'পুনরায় সাজানো ফলাফলের তালিকা',
      result: 'পুনরায় সাজানোর ফলাফল',
      rerankerContent: {
        label: 'পুনরায় সাজানোর বিষয়বস্তু',
        requiredMessage: 'দয়া করে পুনরায় সাজানোর বিষয়বস্তু নির্বাচন করুন'
      },
      higher: 'উচ্চতর',
      ScoreTooltip: 'স্কোর যত বেশি হবে, তত বেশি সম্পর্কযুক্ত হবে।',
      max_paragraph_char_number: 'সর্বোচ্চ অক্ষর',
      reranker_model: {
        label: 'পুনরায় সাজানো',
        placeholder: 'দয়া করে একটি পুনরায় সাজানো নির্বাচন করুন'
      }
    },
    formNode: {
      label: 'ফর্ম ইনপুট',
      text: 'Q&A সময়ে ব্যবহারকারীর ইনপুট সংগ্রহ করুন এবং পরবর্তী প্রক্রিয়াগুলিতে ব্যবহার করুন',
      form_content_format1: 'হ্যালো, দয়া করে নীচের ফর্মটি পূরণ করুন:',
      form_content_format2: 'পূরণ করার পর [জমা দিন] বোতামে ক্লিক করুন।',
      form_data: 'সমস্ত ফর্ম বিষয়বস্তু',
      formContent: {
        label: 'ফর্ম আউটপুট বিষয়বস্তু',
        requiredMessage:
          'দয়া করে এই নোডের আউটপুট বিষয়বস্তু সেট করুন, { form } হল ফর্মের প্লেসহোল্ডার।',
        tooltip: 'এই নোডের আউটপুট বিষয়বস্তু সংজ্ঞায়িত করুন। { form } হল ফর্মের প্লেসহোল্ডার'
      },
      formAllContent: 'সমস্ত ফর্ম বিষয়বস্তু',
      formSetting: 'ফর্ম কনফিগারেশন'
    },
    documentExtractNode: {
      label: 'ডকুমেন্ট বিষয়বস্তু এক্সট্রাকশন',
      text: 'ডকুমেন্ট থেকে বিষয়বস্তু এক্সট্রাক্ট করুন',
      content: 'ডকুমেন্ট বিষয়বস্তু'
    },
    imageUnderstandNode: {
      label: 'চিত্র বোঝা',
      text: 'চিত্র বিশ্লেষণ করুন যেন বস্তু এবং দৃশ্য শনাক্ত করা যায় এবং উত্তর প্রদান করা যায়',
      answer: 'AI বিষয়বস্তু',
      model: {
        label: 'ভিশন মডেল',
        requiredMessage: 'দয়া করে একটি ভিশন মডেল নির্বাচন করুন'
      },
      image: {
        label: 'চিত্র নির্বাচন করুন',
        requiredMessage: 'দয়া করে একটি চিত্র নির্বাচন করুন'
      }
    },
    variableAssignNode: {
      label: 'ভেরিয়েবল অ্যাসাইন',
      text: 'গ্লোবাল ভেরিয়েবলের মান আপডেট করুন',
      assign: 'মান সেট করুন'
    },
    imageGenerateNode: {
      label: 'চিত্র তৈরি',
      text: 'প্রদত্ত টেক্সট বিষয়বস্তুর উপর ভিত্তি করে চিত্র তৈরি করুন',
      answer: 'AI বিষয়বস্তু',
      model: {
        label: 'চিত্র তৈরি মডেল',
        requiredMessage: 'দয়া করে একটি চিত্র তৈরি মডেল নির্বাচন করুন'
      },
      prompt: {
        label: 'পজিটিভ প্রম্পট',
        tooltip: 'জেনারেট করা চিত্রে আপনি যে উপাদান এবং ভিজ্যুয়াল বৈশিষ্ট্যগুলি চান তা বর্ণনা করুন'
      },
      negative_prompt: {
        label: 'নেগেটিভ প্রম্পট',
        tooltip: 'জেনারেট করা চিত্র থেকে আপনি যে উপাদানগুলি বাদ দিতে চান তা বর্ণনা করুন',
        placeholder:
          'দয়া করে যে বিষয়বস্তু জেনারেট করতে চান না তা বর্ণনা করুন, যেমন রঙ, রক্তাক্ত বিষয়বস্তু'
      }
    },
    speechToTextNode: {
      label: 'স্পিচটুটেক্সট',
      text: 'স্পিচ রিকগনিশন মডেলের মাধ্যমে অডিওকে টেক্সটে রূপান্তর করুন',
      stt_model: {
        label: 'স্পিচ রিকগনিশন মডেল'
      },
      audio: {
        label: 'অডিও ফাইল নির্বাচন করুন',
        placeholder: 'দয়া করে একটি অডিও ফাইল নির্বাচন করুন'
      }
    },
    textToSpeechNode: {
      label: 'TTS',
      text: 'স্পিচ সিন্থেসিস মডেলের মাধ্যমে টেক্সটকে অডিওতে রূপান্তর করুন',
      tts_model: {
        label: 'স্পিচ সিন্থেসিস মডেল'
      },
      content: {
        label: 'টেক্সট বিষয়বস্তু নির্বাচন করুন'
      }
    },
    functionNode: {
      label: 'কাস্টম ফাংশন',
      text: 'কাস্টম স্ক্রিপ্ট এক্সিকিউট করুন যাতে ডেটা প্রক্রিয়াকরণ অর্জন করা যায়'
    },
    applicationNode: {
      label: 'APP নোড'
    }
  },
  compare: {
    is_null: 'খালি',
    is_not_null: 'খালি নয়',
    contain: 'থাকে',
    not_contain: 'থাকে না',
    eq: 'সমান',
    ge: 'বড় বা সমান',
    gt: 'বড়',
    le: 'ছোট বা সমান',
    lt: 'ছোট',
    len_eq: 'দৈর্ঘ্য সমান',
    len_ge: 'দৈর্ঘ্য বড় বা সমান',
    len_gt: 'দৈর্ঘ্য বড়',
    len_le: 'দৈর্ঘ্য ছোট বা সমান',
    len_lt: 'দৈর্ঘ্য ছোট'
  },
  FileUploadSetting: {}
}