export default {
  uploadDocument: 'ডকুমেন্ট আপলোড করুন',
  importDocument: 'ডকুমেন্ট ইম্পোর্ট করুন',
  syncDocument: 'ডকুমেন্ট সিঙ্ক করুন',
  selected: 'নির্বাচিত',
  items: 'আইটেম',
  searchBar: {
    placeholder: 'ডকুমেন্ট নাম অনুসারে খুঁজুন'
  },
  setting: {
    migration: 'স্থানান্তর',
    cancelGenerateQuestion: 'প্রশ্ন তৈরি বাতিল করুন',
    cancelVectorization: 'ভেক্টরাইজেশন বাতিল করুন',
    cancelGenerate: 'তৈরি বাতিল করুন',
    export: 'এক্সপোর্ট করুন'
  },
  tip: {
    saveMessage: 'বর্তমান পরিবর্তনগুলি সংরক্ষণ করা হয়নি। বের হওয়ার জন্য নিশ্চিত করুন?',
    cancelSuccess: 'সফল',
    sendMessage: 'সফল',
    vectorizationSuccess: 'সফল',
    nameMessage: 'ডকুমেন্ট নাম খালি হতে পারে না!',
    importMessage: 'সফল',
    migrationSuccess: 'সফল'
  },
  upload: {
    selectFile: 'ফাইল নির্বাচন করুন',
    selectFiles: 'ফোল্ডার নির্বাচন করুন',
    uploadMessage: 'ফাইল আপলোড করতে এখানে ড্র্যাগ করুন অথবা',
    formats: 'সমর্থিত ফরম্যাট:',
    requiredMessage: 'দয়া করে একটি ফাইল আপলোড করুন',
    errorMessage1: 'ফাইলের আকার 100MB ছাড়িয়েছে',
    errorMessage2: 'সমর্থিত নয় এমন ফাইল ফরম্যাট',
    errorMessage3: 'ফাইল খালি হতে পারে না',
    errorMessage4: 'একসাথে সর্বোচ্চ 50টি ফাইল আপলোড করা যাবে',
    template: 'টেমপ্লেট',
    download: 'ডাউনলোড'
  },

  fileType: {
    txt: {
      label: 'টেক্সট ফাইল',
      tip1: '1. আপলোড করার আগে ফাইলে সেগমেন্ট মার্কার স্ট্যান্ডার্ডাইজ করা সুপারিশ করা হয়।',
      tip2: '2. একসাথে সর্বোচ্চ 50টি ফাইল আপলোড করা যাবে, এবং প্রতি ফাইলের আকার 100MB ছাড়িয়ে যাবে না।'
    },
    table: {
      label: 'টেবিল',
      tip1: '1. সংশ্লিষ্ট টেমপ্লেট ডাউনলোড করুন এবং তথ্য সম্পূর্ণ করুন:',
      tip2: '2. প্রথম সারিটি অবশ্যই কলাম শিরোনাম হতে হবে, এবং কলাম শিরোনামগুলি অবশ্যই অর্থপূর্ণ শব্দ হতে হবে। টেবিলের প্রতিটি রেকর্ডকে একটি সেগমেন্ট হিসাবে বিবেচনা করা হবে।',
      tip3: '3. আপলোড করা স্প্রেডশিট ফাইলের প্রতিটি শীটকে একটি ডকুমেন্ট হিসাবে বিবেচনা করা হবে, শীটের নাম হবে ডকুমেন্টের নাম।',
      tip4: '4. একসাথে সর্বোচ্চ 50টি ফাইল আপলোড করা যাবে, এবং প্রতি ফাইলের আকার 100MB ছাড়িয়ে যাবে না।'
    },
    QA: {
      label: 'প্রশ্ন-উত্তর জোড়া',
      tip1: '1. সংশ্লিষ্ট টেমপ্লেট ডাউনলোড করুন এবং তথ্য সম্পূর্ণ করুন:',
      tip2: '2. আপলোড করা স্প্রেডশিট ফাইলের প্রতিটি শীটকে একটি ডকুমেন্ট হিসাবে বিবেচনা করা হবে, শীটের নাম হবে ডকুমেন্টের নাম।',
      tip3: '3. একসাথে সর্বোচ্চ 50টি ফাইল আপলোড করা যাবে, এবং প্রতি ফাইলের আকার 100MB ছাড়িয়ে যাবে না।'
    }
  },
  setRules: {
    title: {
      setting: 'সেগমেন্ট নিয়ম সেট করুন',
      preview: 'প্রিভিউ'
    },
    intelligent: {
      label: 'অটোমেটিক সেগমেন্টেশন (সুপারিশিত)',
      text: 'যদি আপনি সেগমেন্টেশন নিয়ম সেট করার উপায় জানেন না, তাহলে অটোমেটিক সেগমেন্টেশন ব্যবহার করার সুপারিশ করা হয়।'
    },
    advanced: {
      label: 'অ্যাডভান্সড সেগমেন্টেশন',
      text: 'ব্যবহারকারীরা ডকুমেন্ট মানদণ্ডের উপর ভিত্তি করে সেগমেন্ট ডিলিমিটার, সেগমেন্ট দৈর্ঘ্য এবং ক্লিনিং নিয়ম কাস্টমাইজ করতে পারেন।'
    },
    patterns: {
      label: 'সেগমেন্ট ডিলিমিটার',
      tooltip:
        'নির্বাচিত চিহ্নগুলি অনুসারে ক্রমানুসারে রিকার্সিভলি বিভক্ত করুন। যদি বিভক্ত ফলাফল সেগমেন্ট দৈর্ঘ্য ছাড়িয়ে যায়, তাহলে এটি সেগমেন্ট দৈর্ঘ্যে ছাঁটাই করা হবে।',
      placeholder: 'দয়া করে নির্বাচন করুন'
    },
    limit: {
      label: 'সেগমেন্ট দৈর্ঘ্য'
    },
    with_filter: {
      label: 'অটো ক্লিন',
      text: 'ডুপ্লিকেট অতিরিক্ত চিহ্ন, ফাঁকা জায়গা, ফাঁকা লাইন এবং ট্যাব শব্দ অপসারণ করুন।'
    },
    checkedConnect: {
      label: 'প্রশ্নভিত্তিক QA জোড়া ইম্পোর্ট করার সময় "সম্পর্কিত প্রশ্ন" বিভাগ যোগ করুন।'
    }
  },
  buttons: {
    prev: 'পূর্ববর্তী',
    next: 'পরবর্তী',
    import: 'ইম্পোর্ট শুরু করুন',
    preview: 'আবেদন করুন'
  },
  table: {
    name: 'ডকুমেন্ট নাম',
    char_length: 'অক্ষর',
    paragraph: 'সেগমেন্ট',
    all: 'সব',
    updateTime: 'আপডেটের সময়'
  },
  fileStatus: {
    label: 'ফাইলের অবস্থা',
    SUCCESS: 'সফল',
    FAILURE: 'ব্যর্থ',
    EMBEDDING: 'ইনডেক্সিং',
    PENDING: 'কিউয়ে রয়েছে',
    GENERATE: 'তৈরি হচ্ছে',
    SYNC: 'সিঙ্ক হচ্ছে',
    REVOKE: 'বাতিল হচ্ছে',
    finish: 'সম্পন্ন'
  },
  enableStatus: {
    label: 'অবস্থা',
    enable: 'সক্রিয়',
    close: 'নিষ্ক্রিয়'
  },
  sync: {
    label: 'সিঙ্ক',
    confirmTitle: 'ডকুমেন্ট সিঙ্ক করতে নিশ্চিত করুন?',
    confirmMessage1:
      'সিঙ্ক করলে বিদ্যমান ডেটা মুছে ফেলা হবে এবং নতুন ডেটা আনা হবে। সতর্কতার সাথে এগিয়ে যান।',
    confirmMessage2: 'সিঙ্ক করা যাবে না, প্রথমে ডকুমেন্ট URL সেট করুন।',
    successMessage: 'সফল'
  },
  delete: {
    confirmTitle1: 'নিশ্চিত করুন যে',
    confirmTitle2: 'ডকুমেন্ট ব্যাচ ডিলিট করতে চান?',
    confirmMessage:
      'নির্বাচিত ডকুমেন্টের ভিতরের সেগমেন্টগুলি মুছে ফেলা হবে। সতর্কতার সাথে এগিয়ে যান।',
    successMessage: 'সফল',
    confirmTitle3: 'ডকুমেন্ট মুছে ফেলতে নিশ্চিত করুন:',
    confirmMessage1: 'এই ডকুমেন্টের অধীনে',
    confirmMessage2: 'সমস্ত সেগমেন্ট মুছে ফেলা হবে, সতর্কতার সাথে অপারেট করুন।'
  },
  form: {
    source_url: {
      label: 'ডকুমেন্ট URL',
      placeholder: 'ডকুমেন্ট URL লিখুন, প্রতি লাইনে একটি। ভুল URL ইম্পোর্ট ব্যর্থ করবে।',
      requiredMessage: 'দয়া করে ডকুমেন্ট URL লিখুন'
    },
    selector: {
      label: 'সিলেক্টর',
      placeholder: 'ডিফল্ট হল body, আপনি .classname/#idname/tagname লিখতে পারেন'
    },
    hit_handling_method: {
      label: 'রিট্রিভ-রেস্পন্ড',
      tooltip: 'ব্যবহারকারী প্রশ্ন করলে, ম্যাচ করা সেগমেন্টগুলি সেট করা পদ্ধতি অনুসারে পরিচালনা করুন।'
    },
    similarity: {
      label: 'সাদৃশ্য উচ্চতর',
      placeholder: 'সরাসরি সেগমেন্ট বিষয়বস্তু ফেরত দিন',
      requiredMessage: 'দয়া করে সাদৃশ্য মান লিখুন'
    }
  },
  hitHandlingMethod: {
    optimization: 'মডেল অপ্টিমাইজেশন',
    directly_return: 'সরাসরি প্রতিক্রিয়া দিন'
  },
  generateQuestion: {
    title: 'প্রশ্ন তৈরি করুন',
    successMessage: 'সফল',
    tip1: '{data} প্রম্পটে প্লেসহোল্ডার হিসাবে সেগমেন্ট বিষয়বস্তুর স্থান নেয়, যা এক্সিকিউশনের সময় সেগমেন্ট বিষয়বস্তু দিয়ে প্রতিস্থাপিত হয় এবং AI মডেলে পাঠানো হয়;',
    tip2: 'AI মডেল সেগমেন্ট বিষয়বস্তুর উপর ভিত্তি করে সম্পর্কিত প্রশ্ন তৈরি করে। দয়া করে তৈরি করা প্রশ্নগুলিকে',
    tip3: 'ট্যাগের ভিতরে রাখুন, এবং সিস্টেম এই ট্যাগের ভিতরের প্রশ্নগুলি স্বয়ংক্রিয়ভাবে সম্পর্কিত করবে;',
    tip4: 'তৈরির ফলাফল নির্বাচিত মডেল এবং প্রম্পটের উপর নির্ভর করে। ব্যবহারকারীরা সেরা ফলাফল অর্জনের জন্য সমন্বয় করতে পারেন।',
    prompt1:
      'বিষয়বস্তু: {data}\n \n উপরের বিষয়বস্তুটি সংক্ষেপ করুন এবং সংক্ষেপের উপর ভিত্তি করে 5টি প্রশ্ন তৈরি করুন। \nউত্তরের প্রয়োজনীয়তা: \n - কেবল প্রশ্ন আউটপুট করুন; \n - প্রতিটি প্রশ্নকে',
    prompt2: 'ট্যাগে রাখুন।'
  }
}